---
kind: enumMember
id: F:Autodesk.Revit.DB.Plumbing.PipeFlowState.TransitionState
enum: Autodesk.Revit.DB.Plumbing.PipeFlowState
source: html/7e8a8103-9ac3-c933-2c90-9892a2f27d4a.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFlowState.TransitionState

The flow state is Transition